package com.test;

public class Prac0928 {
	
	/*
		백준 5009번(유치원)
				
		홍은 유치원에 근무하는 선생님은 총 세 명이다. 새 학기가 시작될 때, 선생님은 학생들의 반을 나눠야 한다.
		
		선생님은 학생들의 친구 관계를 반 배정에 포함시킨다. 
		모든 아이들은 자신이 좋아하는 순서대로 다른 아이의 이름을 적어서 선생님께 제출했다. 
		좋아하는 순서는 같은 반이 되길 원하는 순서와 같다.
		
		반의 크기가 같지 않아도 상관없다. 유치원에는 매년 새 학생이 들어오기 때문에, 그 아이들로 반을 채우면 된다. 
		하지만, 선생님은 작년에 맡았던 학생을 절대로 다시 맡지 않을 것이다.
		
		뛰어난 컴퓨터 프로그래머 출신인 김상근 선생님은 모든 학생을 작년과 다른 반에 배정하면서, 
		각 반에 있는 모든 학생이 그 반에 속하는 학생이 제출한 순서에서 모두 상위 T위 안에 드는 방법을 찾으려고 한다. 
		이때, T는 가능한 작아야 한다.


	 */	
	
	public static void main(String[] args) {
		
		
	}
}
